Revit 2026 API

# RebarGetEndTreatmentTypeId Method

---

Get the id of the EndTreatmentType that is applied to the rebar.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId GetEndTreatmentTypeId(
	int end
)
```
```vb
Public Function GetEndTreatmentTypeId (
	end As Integer
) As ElementId
```
```cpp
public:
ElementId^ GetEndTreatmentTypeId(
	int end
)
```
```fsharp
member GetEndTreatmentTypeId :
        end : int -> ElementId
```

#### Parameters

end Int32
     0 for the start end treatment, 1 for the end end treatment.

#### Return Value

ElementId The id of a EndTreatmentType, or invalidElementId if the rebar has no end treatment at the specified end.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | end must be 0 or 1. |

#### Reference

Rebar Class

Autodesk.Revit.DB.Structure Namespace